# sinhrks pandasチューリアル

元ネタはsinhrksさんによる以下の記事です。
- [Python pandas データ選択処理をちょっと詳しく <前編>](http://sinhrks.hatenablog.com/entry/2014/11/12/233216)
- [Python pandas データ選択処理をちょっと詳しく <中編>](http://sinhrks.hatenablog.com/entry/2014/11/15/230705)
- [Python pandas データ選択処理をちょっと詳しく <後編>](http://sinhrks.hatenablog.com/entry/2014/11/18/003204)

このJupyter Notebookは、上の記事の内容をJupyter Notebookでおさらいするために作られました。

## Python pandas データ選択処理をちょっと詳しく <前編>

http://sinhrks.hatenablog.com/entry/2014/11/12/233216

- ix: 名前と番号と真偽値リストのごちゃまぜ
- iloc: 番号 or 真偽値リスト
- loc: 名前 or 真偽値リスト

In [ ]:
# pandasの読み込み
import pandas as pd

In [2]:
# シリーズの作成
s = pd.Series([1, 2, 3], index=['I1', 'I2', 'I3'])

In [3]:
s

I1    1
I2    2
I3    3
dtype: int64

In [4]:
# データフレームの作成
df = pd.DataFrame({'C1': [11, 21, 31], 
                   'C2': [12, 22, 32],
                   'C3': [13, 23, 33]},
                 index = ['I1', 'I2', 'I3'])

In [5]:
df

    C1  C2  C3
I1  11  12  13
I2  21  22  23
I3  31  32  33

In [20]:
# シリーズの最初の要素に、番号でアクセス
s[0]

1

In [21]:
# シリーズの最初の要素に、名前でアクセス
s['I1']

1

In [22]:
# データフレームの最初の列に、名前でアクセス
df['C1']

I1    11
I2    21
I3    31
Name: C1, dtype: int64

In [23]:
#df[1]  # 怒られる

In [24]:
# データフレームの2番目の列に、番号でアクセス
df[[1]]

    C2
I1  12
I2  22
I3  32

In [28]:
# データフレームの2番目の行に、番号でアクセス
df[1:2]

    C1  C2  C3
I2  21  22  23

In [29]:
#df['I1']  # 怒られる

In [30]:
# シリーズの要素を論理配列で取得
s[[True, False, True]]

I1    1
I3    3
dtype: int64

In [31]:
# データフレームの要素を論理配列で取得
df[[True, False, True]]

    C1  C2  C3
I1  11  12  13
I3  31  32  33

In [32]:
# 要素が21より大きいところを判別
df > 21

       C1     C2     C3
I1  False  False  False
I2  False   True   True
I3   True   True   True

In [ ]:
# 要素が21より大きいところを抜き出す。それ以外はNaNとする。
df[df > 21]

### 引数による 返り値の違い

In [33]:
s['I1']

1

In [34]:
s[['I1']]

I1    1
dtype: int64

In [35]:
df['C1']

I1    11
I2    21
I3    31
Name: C1, dtype: int64

In [36]:
df[['C1']]

    C1
I1  11
I2  21
I3  31

### ix, loc, iloc

- ix: 名前と番号と真偽値リストのごちゃまぜ
- iloc: 番号 or 真偽値リストのみ
- loc: 名前 or 真偽値リストのみ

In [37]:
s.ix['I2']

2

In [38]:
s.ix[1]

2

In [39]:
df.ix['I2', 'C2']

22

In [40]:
df.ix[1, 1]

22

In [41]:
s.ix[['I1', 'I3']]

I1    1
I3    3
dtype: int64

In [42]:
df.ix[['I1', 'I3'], ['C1', 'C3']]

    C1  C3
I1  11  13
I3  31  33

In [43]:
df.ix[[True, False, True], [True, False, True]]

    C1  C3
I1  11  13
I3  31  33

In [44]:
df.ix[1:, 'C1']

I2    21
I3    31
Name: C1, dtype: int64

DataFrameで第二引数を省略した場合は index への操作になる。

In [45]:
df.ix[1]

C1    21
C2    22
C3    23
Name: I2, dtype: int64

In [46]:
df.ix[:, 'C3']

I1    13
I2    23
I3    33
Name: C3, dtype: int64

In [47]:
df.__getitem__('C3')

I1    13
I2    23
I3    33
Name: C3, dtype: int64

### とはいえ

In [48]:
df2 = pd.DataFrame({1: [11, 21, 31],
                    2: [12, 22, 32],
                    3: [13, 23, 33]},
                   index = [2, 2, 2])

In [49]:
df2

    1   2   3
2  11  12  13
2  21  22  23
2  31  32  33

In [50]:
df2.ix[2, [1, 2]]

    1   2
2  11  12
2  21  22
2  31  32

In [51]:
df2.iloc[2, [1, 2]]

2    32
3    33
Name: 2, dtype: int64

In [52]:
#NG
#df2.iloc[2, 3]

In [53]:
df2.loc[2, [1, 2]]

    1   2
2  11  12
2  21  22
2  31  32

In [54]:
# NG
# df2.loc[1, 2]

## Python pandas データ選択処理をちょっと詳しく <中編>

http://sinhrks.hatenablog.com/entry/2014/11/15/230705

In [55]:
#　データフレームを新規に作成
df = pd.DataFrame({'N1': [1, 2, 3, 4, 5, 6],
                   'N2': [10, 20, 30, 40, 50, 60],
                   'N3': [6, 5, 4, 3, 2, 1],
                   'F1': [1.1, 2.2, 3.3, 4.4, 5.5, 6.6],
                   'F2': [1.1, 2.2, 3.3, 4.4, 5.5, 6.6],
                   'S1': ['A', 'b', 'C', 'D', 'E', 'F'],
                   'S2': ['A', 'X', 'X', 'X', 'E', 'F'],
                   'D1': pd.date_range('2014-11-01', freq='D', periods=6)},
                  index=pd.date_range('2014-11-01', freq='M', periods=6),
                  columns=['N1', 'N2', 'N3', 'F1', 'F2', 'S1', 'S2', 'D1'])

In [56]:
df

            N1  N2  N3   F1   F2 S1 S2         D1
2014-11-30   1  10   6  1.1  1.1  A  A 2014-11-01
2014-12-31   2  20   5  2.2  2.2  b  X 2014-11-02
2015-01-31   3  30   4  3.3  3.3  C  X 2014-11-03
2015-02-28   4  40   3  4.4  4.4  D  X 2014-11-04
2015-03-31   5  50   2  5.5  5.5  E  E 2014-11-05
2015-04-30   6  60   1  6.6  6.6  F  F 2014-11-06

In [57]:
import inspect

In [58]:
from pprint import pprint

In [59]:
inspect.getclasstree([type(df.index)])

[(pandas.indexes.numeric.Int64Index, (pandas.indexes.numeric.NumericIndex,)),
 [(pandas.tseries.index.DatetimeIndex,
   (pandas.tseries.base.DatelikeOps,
    pandas.tseries.base.TimelikeOps,
    pandas.tseries.base.DatetimeIndexOpsMixin,
    pandas.indexes.numeric.Int64Index))],
 (pandas.tseries.base.DatelikeOps, (object,)),
 [(pandas.tseries.index.DatetimeIndex,
   (pandas.tseries.base.DatelikeOps,
    pandas.tseries.base.TimelikeOps,
    pandas.tseries.base.DatetimeIndexOpsMixin,
    pandas.indexes.numeric.Int64Index))],
 (pandas.tseries.base.DatetimeIndexOpsMixin, (object,)),
 [(pandas.tseries.index.DatetimeIndex,
   (pandas.tseries.base.DatelikeOps,
    pandas.tseries.base.TimelikeOps,
    pandas.tseries.base.DatetimeIndexOpsMixin,
    pandas.indexes.numeric.Int64Index))],
 (pandas.tseries.base.TimelikeOps, (object,)),
 [(pandas.tseries.index.DatetimeIndex,
   (pandas.tseries.base.DatelikeOps,
    pandas.tseries.base.TimelikeOps,
    pandas.tseries.base.DatetimeIndexOpsMixin,
    pandas.indexes.numeric.Int64Index))]]

In [60]:
# 行名を表示
df.index

DatetimeIndex(['2014-11-30', '2014-12-31', '2015-01-31', '2015-02-28',
               '2015-03-31', '2015-04-30'],
              dtype='datetime64[ns]', freq='M')

In [61]:
# 列名を表示
df.columns

Index([u'N1', u'N2', u'N3', u'F1', u'F2', u'S1', u'S2', u'D1'], dtype='object')

In [62]:
# Nという文字から始まる列名を探す。
df.columns.map(lambda x: x.startswith('N'))

array([ True,  True,  True, False, False, False, False, False], dtype=bool)

In [63]:
# Nという文字から始まる列名のデータを取り出す（ヒント）
df.ix[:, df.columns.map(lambda x: x.startswith('N'))]

            N1  N2  N3
2014-11-30   1  10   6
2014-12-31   2  20   5
2015-01-31   3  30   4
2015-02-28   4  40   3
2015-03-31   5  50   2
2015-04-30   6  60   1

In [64]:
# N1, N2, N4という列名のデータを取り出す
df.ix[:, ['N1', 'N2', 'N4']]

            N1  N2  N4
2014-11-30   1  10 NaN
2014-12-31   2  20 NaN
2015-01-31   3  30 NaN
2015-02-28   4  40 NaN
2015-03-31   5  50 NaN
2015-04-30   6  60 NaN

In [65]:
# ['N1', 'N2', 'N4']というリストに含まれる列名のデータを取り出す
df.ix[:, df.columns.isin(['N1', 'N2', 'N4'])]

            N1  N2
2014-11-30   1  10
2014-12-31   2  20
2015-01-31   3  30
2015-02-28   4  40
2015-03-31   5  50
2015-04-30   6  60

In [66]:
df

            N1  N2  N3   F1   F2 S1 S2         D1
2014-11-30   1  10   6  1.1  1.1  A  A 2014-11-01
2014-12-31   2  20   5  2.2  2.2  b  X 2014-11-02
2015-01-31   3  30   4  3.3  3.3  C  X 2014-11-03
2015-02-28   4  40   3  4.4  4.4  D  X 2014-11-04
2015-03-31   5  50   2  5.5  5.5  E  E 2014-11-05
2015-04-30   6  60   1  6.6  6.6  F  F 2014-11-06

In [67]:
# 列名で降順に並べる
df[df.columns.sort_values()]

                   D1   F1   F2  N1  N2  N3 S1 S2
2014-11-30 2014-11-01  1.1  1.1   1  10   6  A  A
2014-12-31 2014-11-02  2.2  2.2   2  20   5  b  X
2015-01-31 2014-11-03  3.3  3.3   3  30   4  C  X
2015-02-28 2014-11-04  4.4  4.4   4  40   3  D  X
2015-03-31 2014-11-05  5.5  5.5   5  50   2  E  E
2015-04-30 2014-11-06  6.6  6.6   6  60   1  F  F

In [68]:
df['D1']

2014-11-30   2014-11-01
2014-12-31   2014-11-02
2015-01-31   2014-11-03
2015-02-28   2014-11-04
2015-03-31   2014-11-05
2015-04-30   2014-11-06
Freq: M, Name: D1, dtype: datetime64[ns]

In [69]:
# 
df.index.year == 2015

array([False, False,  True,  True,  True,  True], dtype=bool)

In [70]:
# インデックスの重複を確認
df.index.duplicated()

array([False, False, False, False, False, False], dtype=bool)

In [71]:
df[df['N1'] % 2 == 0]

            N1  N2  N3   F1   F2 S1 S2         D1
2014-12-31   2  20   5  2.2  2.2  b  X 2014-11-02
2015-02-28   4  40   3  4.4  4.4  D  X 2014-11-04
2015-04-30   6  60   1  6.6  6.6  F  F 2014-11-06

In [72]:
indexer = df.sum() > 50
indexer.index[indexer]

Index([u'N2'], dtype='object')

In [73]:
df.ix[:, indexer.index[indexer]]

            N2
2014-11-30  10
2014-12-31  20
2015-01-31  30
2015-02-28  40
2015-03-31  50
2015-04-30  60

In [74]:
df[df.apply(lambda x: x['N1'] * x['N2'], axis=1) > 100]

            N1  N2  N3   F1   F2 S1 S2         D1
2015-02-28   4  40   3  4.4  4.4  D  X 2014-11-04
2015-03-31   5  50   2  5.5  5.5  E  E 2014-11-05
2015-04-30   6  60   1  6.6  6.6  F  F 2014-11-06

In [75]:
df[df['N1'] * df['N2'] > 100]

            N1  N2  N3   F1   F2 S1 S2         D1
2015-02-28   4  40   3  4.4  4.4  D  X 2014-11-04
2015-03-31   5  50   2  5.5  5.5  E  E 2014-11-05
2015-04-30   6  60   1  6.6  6.6  F  F 2014-11-06

In [76]:
df['S1'].isin(['A', 'D'])

2014-11-30     True
2014-12-31    False
2015-01-31    False
2015-02-28     True
2015-03-31    False
2015-04-30    False
Freq: M, Name: S1, dtype: bool

In [77]:
# D1の日付が[1, 2, 3]となっている行を選択
df[df['D1'].dt.day.isin([1, 2, 3])]

            N1  N2  N3   F1   F2 S1 S2         D1
2014-11-30   1  10   6  1.1  1.1  A  A 2014-11-01
2014-12-31   2  20   5  2.2  2.2  b  X 2014-11-02
2015-01-31   3  30   4  3.3  3.3  C  X 2014-11-03

In [78]:
# 重複したデータを落とす
df.drop_duplicates()

            N1  N2  N3   F1   F2 S1 S2         D1
2014-11-30   1  10   6  1.1  1.1  A  A 2014-11-01
2014-12-31   2  20   5  2.2  2.2  b  X 2014-11-02
2015-01-31   3  30   4  3.3  3.3  C  X 2014-11-03
2015-02-28   4  40   3  4.4  4.4  D  X 2014-11-04
2015-03-31   5  50   2  5.5  5.5  E  E 2014-11-05
2015-04-30   6  60   1  6.6  6.6  F  F 2014-11-06

## Python pandas データ選択処理をちょっと詳しく <後編>

http://sinhrks.hatenablog.com/entry/2014/11/18/003204

In [79]:
# 新しいシリーズとデータフレームを作成
s1 = pd.Series([1, 2, 3], index = ['I1', 'I2', 'I3'])

df1 = pd.DataFrame({'C1': [11, 21, 31],
                    'C2': [12, 22, 32],
                    'C3': [13, 23, 33]},
                   index = ['I1', 'I2', 'I3'])

In [80]:
# s1の要素が2より大きいところだけ残し、あとはNaNで埋める
s1.where(s1 > 2)

I1    NaN
I2    NaN
I3    3.0
dtype: float64

In [81]:
# s1の要素が2より大きいところは残し、それ以外は[10, 20, 30]で置き換える
s1.where(s1 > 2, [10, 20, 30])

I1    10
I2    20
I3     3
dtype: int64

In [82]:
# データフレームで22より大きい値の要素を残し、あとはNaNで埋める。
df1.where(df1 > 22)

      C1    C2    C3
I1   NaN   NaN   NaN
I2   NaN   NaN  23.0
I3  31.0  32.0  33.0

In [83]:
# その逆
df1.mask(df1 > 22)

      C1    C2    C3
I1  11.0  12.0  13.0
I2  21.0  22.0   NaN
I3   NaN   NaN   NaN

### query

In [84]:
df1 = pd.DataFrame({'C1': [11, 21, 31],
                    'C2': [12, 22, 32],
                    'C3': [13, 23, 33]},
                   index = ['I1', 'I2', 'I3'])

In [85]:
df1

    C1  C2  C3
I1  11  12  13
I2  21  22  23
I3  31  32  33

In [86]:
df1.query('C1 > 20 & C2 < 30')

    C1  C2  C3
I2  21  22  23

In [87]:
df1.query('C1 in [11, 21]')

    C1  C2  C3
I1  11  12  13
I2  21  22  23

In [88]:
df1.query('C1 > sqrt(400)')

    C1  C2  C3
I2  21  22  23
I3  31  32  33

In [89]:
x = 20
df1.query('C1 > @x')

    C1  C2  C3
I2  21  22  23
I3  31  32  33

In [90]:
df1.query('index in ["I1", "I2"]')

    C1  C2  C3
I1  11  12  13
I2  21  22  23